<a href="https://colab.research.google.com/github/HenriqueCCdA/BC_DS_Projeto1/blob/main/notebooks/Exploratorios/limpeza_de_dados_IPCA_INPC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



---


#Importação das bibliotecas utilizadas



# 1.   Pandas


---



---

In [1]:
import pandas as pd

---


---


# Leitura dos dados semitratados do IPCA.

 Os **dados brutos** foram tirados de:

https://www.ibge.gov.br/estatisticas/economicas/precos-e-custos/9256-indice-nacional-de-precos-ao-consumidor-amplo.html?=&t=o-que-e

A planilha de excel original **"ipca_202104SerieHist"** foi previamente trada através da remoção de linhas e colunas via excel. Foram feitas menos modifições possiveis para não termos o risco de corromper os dados. O arquivo que vamos trabalhar é já modificado **"ipca_202104SerieHist_mod.xls"**.


---



---

In [2]:
dados_semitratados_ipca = pd.read_excel("ipca_202104SerieHist_mod.xls") 
dados_semitratados_ipca.head(20)

       ANO  MÊS  NÚMERO ÍNDICE
0      NaN  NaN            NaN
1   1994.0  JAN         141.31
2      NaN  FEV         198.22
3      NaN  MAR         282.96
4      NaN  ABR         403.73
5      NaN  MAI         581.49
6      NaN  JUN         857.29
7      NaN  JUL         915.93
8      NaN  AGO         932.97
9      NaN  SET         947.24
10     NaN  OUT         972.06
11     NaN  NOV         999.37
12     NaN  DEZ        1016.46
13     NaN  NaN            NaN
14  1995.0  JAN        1033.74
15     NaN  FEV        1044.28
16     NaN  MAR        1060.47
17     NaN  ABR        1086.24
18     NaN  MAI        1115.24
19     NaN  JUN        1140.44

## Tirando todas as **linhas** que todos os elementos são **nan**.**negrito**

In [3]:
dados_semitratados_ipca.dropna(how='all', inplace=True)
dados_semitratados_ipca.head(20)

       ANO  MÊS  NÚMERO ÍNDICE
1   1994.0  JAN         141.31
2      NaN  FEV         198.22
3      NaN  MAR         282.96
4      NaN  ABR         403.73
5      NaN  MAI         581.49
6      NaN  JUN         857.29
7      NaN  JUL         915.93
8      NaN  AGO         932.97
9      NaN  SET         947.24
10     NaN  OUT         972.06
11     NaN  NOV         999.37
12     NaN  DEZ        1016.46
14  1995.0  JAN        1033.74
15     NaN  FEV        1044.28
16     NaN  MAR        1060.47
17     NaN  ABR        1086.24
18     NaN  MAI        1115.24
19     NaN  JUN        1140.44
20     NaN  JUL        1167.35
21     NaN  AGO        1178.91

## Preenchendo os NaN

In [4]:
dados_semitratados_ipca.fillna(method='ffill', inplace=True)
dados_semitratados_ipca.head(20)

       ANO  MÊS  NÚMERO ÍNDICE
1   1994.0  JAN         141.31
2   1994.0  FEV         198.22
3   1994.0  MAR         282.96
4   1994.0  ABR         403.73
5   1994.0  MAI         581.49
6   1994.0  JUN         857.29
7   1994.0  JUL         915.93
8   1994.0  AGO         932.97
9   1994.0  SET         947.24
10  1994.0  OUT         972.06
11  1994.0  NOV         999.37
12  1994.0  DEZ        1016.46
14  1995.0  JAN        1033.74
15  1995.0  FEV        1044.28
16  1995.0  MAR        1060.47
17  1995.0  ABR        1086.24
18  1995.0  MAI        1115.24
19  1995.0  JUN        1140.44
20  1995.0  JUL        1167.35
21  1995.0  AGO        1178.91

## Trocando o tipo da coluna ano para string

In [5]:
dados_semitratados_ipca['ANO'] = dados_semitratados_ipca['ANO'].astype("int")
dados_semitratados_ipca['ANO'] = dados_semitratados_ipca['ANO'].astype("str")
dados_semitratados_ipca.head()

    ANO  MÊS  NÚMERO ÍNDICE
1  1994  JAN         141.31
2  1994  FEV         198.22
3  1994  MAR         282.96
4  1994  ABR         403.73
5  1994  MAI         581.49

## Jutando as colunas **ANO** e **MES** em uma coluna só **ANO/MES**

In [6]:
dados_semitratados_ipca['ANO/MES'] = dados_semitratados_ipca['ANO'] + "/" + dados_semitratados_ipca['MÊS']

## Retirando as colunas **"ANO"** e **"MÊS"**

In [7]:
dados_semitratados_ipca = dados_semitratados_ipca.drop(labels=["ANO", "MÊS"], axis=1)

## **Mudando** o index da tabela para *"ANO/MES"*

In [8]:
dados_semitratados_ipca.set_index("ANO/MES", inplace=True)
dados_semitratados_ipca.head()

          NÚMERO ÍNDICE
ANO/MES
1994/JAN         141.31
1994/FEV         198.22
1994/MAR         282.96
1994/ABR         403.73
1994/MAI         581.49

In [9]:
dados_semitratados_ipca.to_csv("ipca.csv")



---



---


# Leitura dos dados semitratados do IPCA.

Leitura dos dados semitratados do INPC.
Os dados brutos foram tirados de:

https://www.ibge.gov.br/estatisticas/economicas/precos-e-custos/9258-indice-nacional-de-precos-ao-consumidor.html?=&t=series-historicas


---



---

In [10]:
dados_semitratados_inpc = pd.read_excel("inpc_202104SerieHist_mod.xls") 
dados_semitratados_inpc.dropna(how='all', inplace=True)
dados_semitratados_inpc.fillna(method='ffill', inplace=True)
dados_semitratados_inpc['ANO'] = dados_semitratados_inpc['ANO'].astype("int")
dados_semitratados_inpc['ANO'] = dados_semitratados_inpc['ANO'].astype("str")
dados_semitratados_inpc['ANO/MES'] = dados_semitratados_inpc['ANO'] + "/" + dados_semitratados_inpc['MÊS']
dados_semitratados_inpc = dados_semitratados_inpc.drop(labels=["ANO", "MÊS"], axis=1)
dados_semitratados_inpc.set_index("ANO/MES", inplace=True)

In [11]:
dados_semitratados_inpc.head()

          NÚMERO ÍNDICE
ANO/MES
1994/JAN         141.32
1994/FEV         198.65
1994/MAR         284.23
1994/ABR         406.05
1994/MAI         579.56

In [12]:
dados_semitratados_ipca.to_csv("inpc.csv")



---



---